Levitrevisan/STM32_Inverter/main.c
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"

#define PWM_TIMERS_PRESCALER 0	
#define PWM_TIMERS_PERIOD 3550
#define PWM_TIMERS_INIT_PULSE 500

// Senoid Pattern generated in MatLab Script on subfolder

int senoid_pwm[34] = {0 ,337 ,672 ,1000 ,1319 ,1627 ,1919 ,2194 ,2450 ,2683 ,2892 ,3074 ,3229 ,3355 ,3450 ,3514 ,3546 ,3546 ,3514 ,3450 ,3355 ,3229 ,3074 ,2892 ,2683 ,2450 ,2194 ,1919 ,1627 ,1319 ,1000 ,672 ,337};

// State Control Variables

char R_is_positive = 1;
char S_is_positive = 1;
char T_is_positive = 1;

int t_senoid_R = 0;
int t_senoid_S = 34/3;
int t_senoid_T = 34*2/3;

// Functions Prototypes										

void delay(unsigned int nCount);
void InitializeTimer2();
void InitializeTimer3();
void InitializeTimer4IT();
void InitializePWMChannels();
void InitializePWMGPIO();
void InitializeLEDGPIO();
void toggle_led_PC13();
void changeRpositiveDutyCycle(int dutyCycle);
void changeRnegativeDutyCycle(int dutyCycle);
void changeSpositiveDutyCycle(int dutyCycle);
void changeSnegativeDutyCycle(int dutyCycle);
void changeTpositiveDutyCycle(int dutyCycle);
void changeTnegativeDutyCycle(int dutyCycle);
void updatePhaseR();
void updatePhaseS();
void updatePhaseT();

void setup(){
	InitializeLEDGPIO();
	InitializeTimer2();
	InitializeTimer3();
	InitializeTimer4IT();
	InitializePWMChannels();
	InitializePWMGPIO();
}


int main(){
	
	setup();
	
	changeRpositiveDutyCycle(200);
	changeRnegativeDutyCycle(20);
	changeSpositiveDutyCycle(1024);
	changeSnegativeDutyCycle(3550);
	changeTpositiveDutyCycle(1024);
	changeTnegativeDutyCycle(4095);	
	
	while(1){

	}
	

return 0;
}

void InitializeLEDGPIO(){
	// Enable clock for GPIOC
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_StructInit(&GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin	= GPIO_Pin_13; //Analog voltages to be measured are connected to pins 1 and 2 of port A, 
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_Out_PP; //Analog input mode for ADC
	GPIO_Init(GPIOC, &GPIO_InitStructure); // calls the function to actually configure the port A.
}

void InitializePWMGPIO(){
	// Enable clock for GPIOA
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_StructInit(&GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;					//PA0
	GPIO_Init(GPIOA , &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;					//PA1
	GPIO_Init(GPIOA , &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;					//PA2
	GPIO_Init(GPIOA , &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;					//PA3
	GPIO_Init(GPIOA , &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;					//PA6
	GPIO_Init(GPIOA , &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;					//PA7
	GPIO_Init(GPIOA , &GPIO_InitStructure);
	
}

void InitializeTimer2(){
	// Enable clock for timer 2
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2 , ENABLE);
	// Create and initialize TimeBase structure
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	// Configure TimeBase structure
	TIM_TimeBaseStructure.TIM_Prescaler	= PWM_TIMERS_PRESCALER;//SystemCoreClock/8000 - 1; // considering 8MHz, 1ms
	TIM_TimeBaseStructure.TIM_Period = PWM_TIMERS_PERIOD; // 0..999
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
	TIM_Cmd(TIM2, ENABLE);
	
}

void InitializeTimer3(){
	// Enable clock for timer 2
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3 , ENABLE);
	// Create and initialize TimeBase structure
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	// Configure TimeBase structure
	TIM_TimeBaseStructure.TIM_Prescaler	= PWM_TIMERS_PRESCALER;//SystemCoreClock/8 - 1; // considering 8MHz, 1ms
	TIM_TimeBaseStructure.TIM_Period = PWM_TIMERS_PERIOD; // 0..999
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
	TIM_Cmd(TIM3, ENABLE);
	
}

void InitializePWMChannels(){
	
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = PWM_TIMERS_INIT_PULSE;
	
	//TIM_OCx < X is the PWM channel number
	TIM_OC1Init(TIM2, &TIM_OCInitStructure); //PA0
	TIM_OC2Init(TIM2, &TIM_OCInitStructure); //PA1
	TIM_OC3Init(TIM2, &TIM_OCInitStructure); //PA2
	TIM_OC4Init(TIM2, &TIM_OCInitStructure); //PA3
	TIM_OC1Init(TIM3, &TIM_OCInitStructure); //PA6
	TIM_OC2Init(TIM3, &TIM_OCInitStructure); //PA7

}

void delay(unsigned int nCount){
		unsigned int i, j;
 
		for (i = 0; i < nCount; i++)
				for (j = 0; j < 0x2AFF; j++);
}

void changeRpositiveDutyCycle(int dutyCycle){
	
//	TIM_OCInitTypeDef TIM_OCInitStructure;
//	TIM_OCStructInit(&TIM_OCInitStructure);
//	
//	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
//	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
//	TIM_OCInitStructure.TIM_Pulse = dutyCycle;
//	
//	TIM_OC1Init(TIM2, &TIM_OCInitStructure); //PA0
	TIM2->CCR1 = dutyCycle; 
	
}

void changeRnegativeDutyCycle(int dutyCycle){
	
//	TIM_OCInitTypeDef TIM_OCInitStructure;
//	TIM_OCStructInit(&TIM_OCInitStructure);
//	
//	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;
//	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
//	TIM_OCInitStructure.TIM_Pulse = dutyCycle;
//	
//	TIM_OC2Init(TIM2, &TIM_OCInitStructure); //PA1
	TIM2->CCR2 = dutyCycle; 
}

void changeSpositiveDutyCycle(int dutyCycle){
TIM2->CCR3 = dutyCycle; //0 .. 8191
}

void changeSnegativeDutyCycle(int dutyCycle){
TIM2->CCR4 = dutyCycle; //0 .. 8191
}

void changeTpositiveDutyCycle(int dutyCycle){
TIM3->CCR1 = dutyCycle; //0 .. 8191
}

void changeTnegativeDutyCycle(int dutyCycle){
TIM3->CCR2 = dutyCycle; //0 .. 8191
}
void InitializeTimer4IT(){
	
	// Configure NVIC
	NVIC_InitTypeDef NVIC_InitStructure;
	// No StructInit call in API
	NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
	
	// Enable clock for timer 4
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4 , ENABLE);
	// Create and initialize TimeBase structure
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;
	TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
	// Configure TimeBase structure
	TIM_TimeBaseStructure.TIM_Prescaler	= 1; // considering 72MHz, 1ms
	TIM_TimeBaseStructure.TIM_Period = 8999; // each 1ms
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);
	
	// Enable interrupt and starting timer 4
	TIM_ITConfig(TIM4 , TIM_IT_Update , ENABLE);
	TIM_Cmd(TIM4 , ENABLE);
	
}

void TIM4_IRQHandler(void){
	//update phases SPWMs
	updatePhaseR();
	updatePhaseS();
	updatePhaseT();
	//"clear interruption flag"
	TIM_ClearITPendingBit(TIM4 ,TIM_IT_Update);
	
	
}

void updatePhaseR(){
	if (t_senoid_R < 33){
		if (R_is_positive == 1){
			changeRpositiveDutyCycle(senoid_pwm[t_senoid_R]);
		}
		if (R_is_positive == 0){
			changeRnegativeDutyCycle(senoid_pwm[t_senoid_R]);
		}
		t_senoid_R++;
	} else {
		if (R_is_positive == 1){
			R_is_positive = 0;
			changeRpositiveDutyCycle(0);
		}
		else{
			R_is_positive = 1;
			changeRnegativeDutyCycle(0);
		}
		t_senoid_R = 0;
	}
}

void updatePhaseS(){
	if (t_senoid_S < 33){
		if (S_is_positive == 1){
			changeSpositiveDutyCycle(senoid_pwm[t_senoid_S]);
		}
		if (S_is_positive == 0){
			changeSnegativeDutyCycle(senoid_pwm[t_senoid_S]);
		}
		t_senoid_S++;
	} else {
		if (S_is_positive == 1){
			S_is_positive = 0;
			changeSpositiveDutyCycle(0);
		}
		else{
			S_is_positive = 1;
			changeSnegativeDutyCycle(0);
		}
		t_senoid_S = 0;
	}
}

void updatePhaseT(){
	if (t_senoid_T < 33){
		if (T_is_positive == 1){
			changeTpositiveDutyCycle(senoid_pwm[t_senoid_T]);
		}
		if (T_is_positive == 0){
			changeTnegativeDutyCycle(senoid_pwm[t_senoid_T]);
		}
		t_senoid_T++;
	} else {
		if (T_is_positive == 1){
			T_is_positive = 0;
			changeTpositiveDutyCycle(0);
		}
		else{
			T_is_positive = 1;
			changeTnegativeDutyCycle(0);
		}
		t_senoid_T = 0;
	}
}

void toggle_led_PC13(){
	//toggle LED on pin PC13
		if(GPIO_ReadOutputDataBit(GPIOC, GPIO_Pin_13)){
			GPIO_ResetBits(GPIOC, GPIO_Pin_13);
		} else {
			GPIO_SetBits(GPIOC, GPIO_Pin_13);
		}

}


